app/helpers/authers_helper.rb

SELECT "authers"."name", "authers"."id" FROM "authers"
---
  def getAuther
    Auther.pluck(:name, :id)