app/controllers/authers_controller.rb

  def index
    @authers = Auther.all
---
SELECT "authers".* FROM "authers"

  def create
    @auther = Auther.new(auther_params)

    respond_to do |format|
      if @auther.save
---
INSERT INTO "authers" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sanket"], ["address", "My address"], ["created_at", "2022-06-04 08:14:29.504795"], ["updated_at", "2022-06-04 08:14:29.504795"]]

  def update
    respond_to do |format|
      if @auther.update(auther_params)
---
UPDATE "authers" SET "updated_at" = ? WHERE "authers"."id" = ?  [["updated_at", "2022-06-04 09:40:09.380564"], ["id", 2]]

    def set_auther
      @auther = Auther.find(params[:id])
---
SELECT "authers".* FROM "authers" WHERE "authers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]