app/controllers/books_controller.rb

INSERT INTO "books" ("name", "auther_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Book 1"], ["auther_id", 1], ["created_at", "2022-06-04 08:25:18.111513"], ["updated_at", "2022-06-04 08:25:18.111513"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2022-06-04 08:42:56.993992"], ["id", 2]]
---
  def update
    if @book.cover_photos.attached?
      cover_photos = params[:book][:cover_photos].reject(&:blank?)
      @book.cover_photos.attach(cover_photos)
    elsif params[:book][:cover_photos].reject(&:blank?).present?
      @book.cover_photos.attach(book_params[:cover_photos])
    end

    respond_to do |format|
      if @book.update(update_book_params)